<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'يجب قبول هذا الحقل  .',
    'accepted_if' => 'يجب قبول هذا الحقل   عندما :other يكون :value.',
    'active_url' => 'هذا الحقل   يجب أن يكون عنوان URL صالحًا.',
    'after' => 'هذا الحقل   يجب أن يكون تاريخًا بعد :date.',
    'after_or_equal' => 'هذا الحقل   يجب أن يكون تاريخًا بعد أو يساوي :date.',
    'alpha' => 'يجب أن يحتوي هذا الحقل   على أحرف فقط.',
    'alpha_dash' => 'يجب أن يحتوي هذا الحقل   على أحرف وأرقام وشرطات وشرطات سفلية فقط.',
    'alpha_num' => 'يجب أن يحتوي هذا الحقل   على أحرف وأرقام فقط.',
    'array' => 'يجب أن يكون هذا الحقل   مصفوفة.',
    'ascii' => 'يجب أن يحتوي هذا الحقل   على أحرف أبجدية أو رموز أحرف أو أرقام فقط.',
    'before' => 'هذا الحقل   يجب أن يكون تاريخًا قبل :date.',
    'before_or_equal' => 'هذا الحقل   يجب أن يكون تاريخًا قبل أو يساوي :date.',
    'between' => [
        'array' => 'يجب أن يحتوي هذا الحقل   على بين :min و :max عنصرًا.',
        'file' => 'يجب أن يكون هذا الحقل   بين :min و :max كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   بين :min و :max.',
        'string' => 'يجب أن يكون هذا الحقل   بين :min و :max حرفًا.',
    ],
    'boolean' => 'يجب أن يكون هذا الحقل   صحيحًا أو خطأ.',
    'can' => 'يحتوي هذا الحقل   على قيمة غير مسموح بها.',
    'confirmed' => 'تأكيد هذا الحقل   غير متطابق.',
    'current_password' => 'كلمة المرور غير صحيحة.',
    'date' => 'يجب أن يكون هذا الحقل   تاريخًا صالحًا.',
    'date_equals' => 'يجب أن يكون هذا الحقل   تاريخًا يساوي :date.',
    'date_format' => 'يجب أن يتطابق هذا الحقل   مع التنسيق :format.',
    'decimal' => 'يجب أن يحتوي هذا الحقل   على :decimal أماكن عشرية.',
    'declined' => 'يجب رفض هذا الحقل  .',
    'declined_if' => 'يجب رفض هذا الحقل   عندما :other يكون :value.',
    'different' => 'يجب أن يكون هذا الحقل   مختلفًا عن :other.',
    'digits' => 'يجب أن يكون هذا الحقل   :digits أرقام.',
    'digits_between' => 'يجب أن يكون هذا الحقل   بين :min و :max أرقام.',
    'dimensions' => 'يحتوي هذا الحقل   على أبعاد صورة غير صالحة.',
    'distinct' => 'يحتوي هذا الحقل   على قيمة مكررة.',
    'doesnt_end_with' => 'يجب ألا ينتهي هذا الحقل   بأحد القيم التالية: :values.',
    'doesnt_start_with' => 'يجب ألا يبدأ هذا الحقل   بأحد القيم التالية: :values.',
    'email' => 'يجب أن يكون هذا الحقل   عنوان بريد إلكتروني صالحًا.',
    'ends_with' => 'يجب أن ينتهي هذا الحقل   بأحد القيم التالية: :values.',
    'enum' => 'القيمة المحددة  غير صالحة.',
    'exists' => 'القيمة المحددة  غير صالحة.',
    'file' => 'يجب أن يكون هذا الحقل   ملفًا.',
    'filled' => 'يجب أن يحتوي هذا الحقل   على قيمة.',
    'gt' => [
        'array' => 'يجب أن يحتوي هذا الحقل   على أكثر من :value عنصر.',
        'file' => 'يجب أن يكون هذا الحقل   أكبر من :value كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   أكبر من :value.',
        'string' => 'يجب أن يكون هذا الحقل   أكبر من :value حرف.',
    ],
    'gte' => [
        'array' => 'يجب أن يحتوي هذا الحقل   على :value عنصر أو أكثر.',
        'file' => 'يجب أن يكون هذا الحقل   أكبر من أو يساوي :value كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   أكبر من أو يساوي :value.',
        'string' => 'يجب أن يكون هذا الحقل   أكبر من أو يساوي :value حرف.',
    ],
    'image' => 'يجب أن يكون هذا الحقل   صورة.',
    'in' => 'القيمة المحددة  غير صالحة.',
    'in_array' => 'يجب أن يحتوي هذا الحقل   على قيمة من :other.',
    'integer' => 'يجب أن يكون هذا الحقل   عددًا صحيحًا.',
    'ip' => 'يجب أن يكون هذا الحقل   عنوان IP صالحًا.',
    'ipv4' => 'يجب أن يكون هذا الحقل   عنوان IPv4 صالحًا.',
    'ipv6' => 'يجب أن يكون هذا الحقل   عنوان IPv6 صالحًا.',
    'json' => 'يجب أن يكون هذا الحقل   سلسلة JSON صالحة.',
    'lowercase' => 'يجب أن يكون هذا الحقل   في حالة صغيرة.',
    'lt' => [
        'array' => 'يجب أن يحتوي هذا الحقل   على أقل من :value عنصر.',
        'file' => 'يجب أن يكون هذا الحقل   أقل من :value كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   أقل من :value.',
        'string' => 'يجب أن يكون هذا الحقل   أقل من :value حرف.',
    ],
    'lte' => [
        'array' => 'يجب ألا يحتوي هذا الحقل   على أكثر من :value عنصر.',
        'file' => 'يجب أن يكون هذا الحقل   أقل من أو يساوي :value كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   أقل من أو يساوي :value.',
        'string' => 'يجب أن يكون هذا الحقل   أقل من أو يساوي :value حرف.',
    ],
    'mac_address' => 'يجب أن يكون هذا الحقل   عنوان MAC صالحًا.',
    'max' => [
        'array' => 'يجب ألا يحتوي هذا الحقل   على أكثر من :max عنصر.',
        'file' => 'يجب ألا يكون هذا الحقل   أكبر من :max كيلوبايت.',
        'numeric' => 'يجب ألا يكون هذا الحقل   أكبر من :max.',
        'string' => 'يجب ألا يكون هذا الحقل   أكبر من :max حرف.',
    ],
    'max_digits' => 'يجب ألا يحتوي هذا الحقل   على أكثر من :max أرقام.',
    'mimes' => 'يجب أن يكون هذا الحقل   ملفًا من النوع: :values.',
    'mimetypes' => 'يجب أن يكون هذا الحقل   ملفًا من النوع: :values.',
    'min' => [
        'array' => 'يجب أن يحتوي هذا الحقل   على الأقل :min عنصرًا.',
        'file' => 'يجب أن يكون هذا الحقل   على الأقل :min كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   على الأقل :min.',
        'string' => 'يجب أن يكون هذا الحقل   على الأقل :min حرفًا.',
    ],
    'min_digits' => 'يجب أن يحتوي هذا الحقل   على الأقل :min أرقام.',
    'missing' => 'يجب أن يكون هذا الحقل   مفقودًا.',
    'missing_if' => 'يجب أن يكون هذا الحقل   مفقودًا عندما :other يكون :value.',
    'missing_unless' => 'يجب أن يكون هذا الحقل   مفقودًا ما لم يكن :other هو :value.',
    'missing_with' => 'يجب أن يكون هذا الحقل   مفقودًا عندما تكون :values موجودة.',
    'missing_with_all' => 'يجب أن يكون هذا الحقل   مفقودًا عندما تكون :values موجودة.',
    'multiple_of' => 'يجب أن يكون هذا الحقل   مضاعفًا لـ :value.',
    'not_in' => 'القيمة المحددة  غير صالحة.',
    'not_regex' => 'تنسيق هذا الحقل   غير صالح.',
    'numeric' => 'يجب أن يكون هذا الحقل   رقمًا.',
    'password' => [
        'letters' => 'يجب أن يحتوي هذا الحقل   على حرف واحد على الأقل.',
        'mixed' => 'يجب أن يحتوي هذا الحقل   على حرف كبير وحرف صغير ورقم واحد على الأقل.',
        'numbers' => 'يجب أن يحتوي هذا الحقل   على رقم واحد على الأقل.',
        'symbols' => 'يجب أن يحتوي هذا الحقل   على رمز واحد على الأقل.',
        'uncompromised' => 'القيمة  المعطاة ظهرت في تسريب بيانات. يرجى اختيار  مختلفًا.',
    ],
    'present' => 'يجب أن يكون هذا الحقل   موجودًا.',
    'prohibited' => 'هذا الحقل   ممنوع.',
    'prohibited_if' => 'هذا الحقل   ممنوع عندما :other يكون :value.',
    'prohibited_unless' => 'هذا الحقل   ممنوع ما لم :other يكون في :values.',
    'prohibits' => 'يمنع هذا الحقل   :other من الوجود.',
    'regex' => 'تنسيق هذا الحقل   غير صالح.',
    'required' => 'هذا الحقل   مطلوب.',
    'required_array_keys' => 'يجب أن يحتوي هذا الحقل   على مدخلات لـ :values.',
    'required_if' => 'هذا الحقل   مطلوب عندما :other يكون :value.',
    'required_if_accepted' => 'هذا الحقل   مطلوب عندما يتم قبول :other.',
    'required_unless' => 'هذا الحقل   مطلوب ما لم :other يكون في :values.',
    'required_with' => 'هذا الحقل   مطلوب عندما :values موجودة.',
    'required_with_all' => 'هذا الحقل   مطلوب عندما :values موجودة.',
    'required_without' => 'هذا الحقل   مطلوب عندما :values غير موجودة.',
    'required_without_all' => 'هذا الحقل   مطلوب عندما لا تكون :values موجودة.',
    'same' => 'يجب أن يتطابق هذا الحقل   مع :other.',
    'size' => [
        'array' => 'يجب أن يحتوي هذا الحقل   على :size عنصرًا.',
        'file' => 'يجب أن يكون هذا الحقل   :size كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل   :size.',
        'string' => 'يجب أن يكون هذا الحقل   :size حرفًا.',
    ],
    'starts_with' => 'يجب أن يبدأ هذا الحقل   بأحد القيم التالية: :values.',
    'string' => 'يجب أن يكون هذا الحقل   نصًا.',
    'timezone' => 'يجب أن يكون هذا الحقل   منطقة زمنية صالحة.',
    'unique' => 'تم اختيار  مسبقًا.',
    'uploaded' => 'فشل في تحميل .',
    'uppercase' => 'يجب أن يكون هذا الحقل   في حالة كبيرة.',
    'url' => 'يجب أن يكون هذا الحقل   عنوان URL صالحًا.',
    'ulid' => 'يجب أن يكون هذا الحقل   ULID صالحًا.',
    'uuid' => 'يجب أن يكون هذا الحقل   UUID صالحًا.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [
        'password' => 'كلمة السر'
    ],

];
